MikroElektronika/core_packages/ARM/gcc_clang/def/ti/MSPM0G1518/mcu.h
/* IOMUX_PINCM63[PF] Bits */
#define IOMUX_PINCM63_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM63_PF_GPIOC_DIO14                  ((uint32_t)0X00000001)
#define IOMUX_PINCM63_PF_TIMG9_CCP1                   ((uint32_t)0X00000007)
#define IOMUX_PINCM63_PF_SPI2_SCLK                    ((uint32_t)0X0000000C)

/* IOMUX_PINCM64[PF] Bits */
#define IOMUX_PINCM64_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM64_PF_GPIOC_DIO15                  ((uint32_t)0X00000001)

/* IOMUX_PINCM65[PF] Bits */
#define IOMUX_PINCM65_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM65_PF_GPIOB_DIO28                  ((uint32_t)0X00000001)
#define IOMUX_PINCM65_PF_I2C2_SCL                     ((uint32_t)0X00000002)
#define IOMUX_PINCM65_PF_SPI1_CS0                     ((uint32_t)0X00000003)
#define IOMUX_PINCM65_PF_TIMA_FAULT0                  ((uint32_t)0X00000004)
#define IOMUX_PINCM65_PF_TIMA0_CCP0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM65_PF_TIMG0_CCP0                   ((uint32_t)0X00000006)
#define IOMUX_PINCM65_PF_UART5_RX                     ((uint32_t)0X00000007)
#define IOMUX_PINCM65_PF_TIMG14_CCP0                  ((uint32_t)0X0000000A)
#define IOMUX_PINCM65_PF_UART6_RX                     ((uint32_t)0X0000000C)

/* IOMUX_PINCM66[PF] Bits */
#define IOMUX_PINCM66_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM66_PF_GPIOB_DIO29                  ((uint32_t)0X00000001)
#define IOMUX_PINCM66_PF_I2C2_SDA                     ((uint32_t)0X00000002)
#define IOMUX_PINCM66_PF_SPI1_POCI                    ((uint32_t)0X00000003)
#define IOMUX_PINCM66_PF_TIMA_FAULT1                  ((uint32_t)0X00000004)
#define IOMUX_PINCM66_PF_TIMA0_CCP0_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM66_PF_TIMG0_CCP1                   ((uint32_t)0X00000006)
#define IOMUX_PINCM66_PF_UART5_TX                     ((uint32_t)0X00000007)
#define IOMUX_PINCM66_PF_TIMG9_CCP0                   ((uint32_t)0X00000008)
#define IOMUX_PINCM66_PF_TIMG14_CCP1                  ((uint32_t)0X0000000A)
#define IOMUX_PINCM66_PF_UART6_TX                     ((uint32_t)0X0000000C)

/* IOMUX_PINCM67[PF] Bits */
#define IOMUX_PINCM67_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM67_PF_GPIOB_DIO30                  ((uint32_t)0X00000001)
#define IOMUX_PINCM67_PF_UART1_CTS                    ((uint32_t)0X00000002)
#define IOMUX_PINCM67_PF_SPI1_PICO                    ((uint32_t)0X00000003)
#define IOMUX_PINCM67_PF_TIMA_FAULT2                  ((uint32_t)0X00000004)
#define IOMUX_PINCM67_PF_TIMA0_CCP1                   ((uint32_t)0X00000005)
#define IOMUX_PINCM67_PF_UART5_CTS                    ((uint32_t)0X00000007)
#define IOMUX_PINCM67_PF_TIMG9_CCP1                   ((uint32_t)0X00000008)
#define IOMUX_PINCM67_PF_TIMG14_CCP2                  ((uint32_t)0X00000009)
#define IOMUX_PINCM67_PF_UART6_CTS                    ((uint32_t)0X0000000C)

/* IOMUX_PINCM68[PF] Bits */
#define IOMUX_PINCM68_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM68_PF_GPIOB_DIO31                  ((uint32_t)0X00000001)
#define IOMUX_PINCM68_PF_UART1_RTS                    ((uint32_t)0X00000002)
#define IOMUX_PINCM68_PF_SPI1_SCLK                    ((uint32_t)0X00000003)
#define IOMUX_PINCM68_PF_TIMG8_IDX                    ((uint32_t)0X00000004)
#define IOMUX_PINCM68_PF_TIMA0_CCP1_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM68_PF_UART5_RTS                    ((uint32_t)0X00000007)
#define IOMUX_PINCM68_PF_TIMG9_IDX                    ((uint32_t)0X00000008)
#define IOMUX_PINCM68_PF_TIMG14_CCP3                  ((uint32_t)0X00000009)
#define IOMUX_PINCM68_PF_UART6_RTS                    ((uint32_t)0X0000000C)

/* IOMUX_PINCM69[PF] Bits */
#define IOMUX_PINCM69_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM69_PF_GPIOC_DIO16                  ((uint32_t)0X00000001)

/* IOMUX_PINCM70[PF] Bits */
#define IOMUX_PINCM70_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM70_PF_GPIOC_DIO17                  ((uint32_t)0X00000001)
#define IOMUX_PINCM70_PF_TIMG14_CCP2                  ((uint32_t)0X00000007)

/* IOMUX_PINCM71[PF] Bits */
#define IOMUX_PINCM71_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM71_PF_GPIOC_DIO18                  ((uint32_t)0X00000001)

/* IOMUX_PINCM72[PF] Bits */
#define IOMUX_PINCM72_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM72_PF_GPIOC_DIO19                  ((uint32_t)0X00000001)
#define IOMUX_PINCM72_PF_TIMG9_CCP1                   ((uint32_t)0X00000007)

/* IOMUX_PINCM73[PF] Bits */
#define IOMUX_PINCM73_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM73_PF_GPIOC_DIO20                  ((uint32_t)0X00000001)

/* IOMUX_PINCM74[PF] Bits */
#define IOMUX_PINCM74_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM74_PF_GPIOC_DIO00                  ((uint32_t)0X00000001)
#define IOMUX_PINCM74_PF_UART1_TX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM74_PF_SPI1_CS3_CD_POCI3            ((uint32_t)0X00000003)
#define IOMUX_PINCM74_PF_TIMG8_CCP0                   ((uint32_t)0X00000004)
#define IOMUX_PINCM74_PF_TIMA0_CCP2                   ((uint32_t)0X00000005)

/* IOMUX_PINCM75[PF] Bits */
#define IOMUX_PINCM75_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM75_PF_GPIOC_DIO01                  ((uint32_t)0X00000001)
#define IOMUX_PINCM75_PF_UART1_RX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM75_PF_SPI1_CS2_POCI2               ((uint32_t)0X00000003)
#define IOMUX_PINCM75_PF_TIMG8_CCP1                   ((uint32_t)0X00000004)
#define IOMUX_PINCM75_PF_TIMA0_CCP2_CMPL              ((uint32_t)0X00000005)

/* IOMUX_PINCM76[PF] Bits */
#define IOMUX_PINCM76_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM76_PF_GPIOC_DIO02                  ((uint32_t)0X00000001)
#define IOMUX_PINCM76_PF_I2C2_SCL                     ((uint32_t)0X00000002)
#define IOMUX_PINCM76_PF_SPI1_CS0                     ((uint32_t)0X00000003)
#define IOMUX_PINCM76_PF_TIMA_FAULT0                  ((uint32_t)0X00000004)
#define IOMUX_PINCM76_PF_TIMA0_CCP0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM76_PF_TIMG0_CCP0                   ((uint32_t)0X00000006)

